elmot/picture-weather-station/components/tuanpmt__esp_epaper/examples/esp32s3_photopainter/sdkconfig.defaults
# ESP32-S3-PhotoPainter Example Configuration
# Board: Waveshare ESP32-S3-PhotoPainter
# Panel: GDEP073E01 (800x480 6-Color)

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM (PhotoPainter has 8MB PSRAM - required for large framebuffer)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Main task stack (larger for dithering)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
